Revit 2024 API
BuiltInFailures.DividedPathFailures.DividedPathIntersectionPolycurveParamsStepFailed Property
 Intersection failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedPathIntersectionPolycurveParamsStepFailed { get; }
Visual Basic
Public Shared ReadOnly Property DividedPathIntersectionPolycurveParamsStepFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedPathIntersectionPolycurveParamsStepFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace